{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 200], "trainable": true, "activity_regularizer": null, "input_length": 200, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 20000, "embeddings_constraint": null, "output_dim": 100}, "class_name": "Embedding"}, {"config": {"unroll": false, "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 100, "dropout": 0.2, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_1", "go_backwards": false, "stateful": false, "return_state": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}